Tekla Open API Reference for Tekla Structures 2025
ShapeItem.Fingerprint Property
 A fingerprint value calculated by Tekla Structures to provide quick comparison of geometries to avoid inserting same shape multiple times to the catalog. More rigorous comparison is done only for geometries that result in identical fingerprints.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Fingerprint { get; }
Public ReadOnly Property Fingerprint As String
	Get
Property Value
Type: String
See Also
Reference
ShapeItem Class
Tekla.Structures.Catalogs Namespace